![](images/09_01.png)

In [1]:
df = read.table("./data/Table0.txt")

In [2]:
df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

In [3]:
names(df) = c("Name", 'Age', 'Height', 'Weight', 'Sex')

In [4]:
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [5]:
row.names(df) = df$Name

In [6]:
df

         Name     Age Height Weight Sex
Alex     Alex     25  177    57     F
Lilly    Lilly    31  163    69     F
Mark     Mark     23  190    83     M
Oliver   Oliver   52  179    75     M
Martha   Martha   76  163    70     F
Lucas    Lucas    49  183    83     M
Caroline Caroline 26  164    53     F

In [7]:
df$Name = NULL

In [8]:
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [9]:
write.table(df, file="./data/Table0_new.txt", sep = '\t')

In [10]:
df_new = read.table("./data/Table0_new.txt")

In [11]:
df_new

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F